<?
$direct=$_GET['direct'];
$jj=mysql_query("select sm_id from system_member where sm_id='$direct' limit 1")or die(mysql_error());
$jn=mysql_num_rows($jj);
?>
<div id="detial_page">
  <h3 class="title_page">แบบฟอร์มสมัครสมาชิก</h3>
  <form action="" method="post" name="formregister" id="formregister">
    <input type="hidden" name="sr_direct" value="<?=$direct;?>">
    <div class="information roundend">โปรดทราบ กรุณาระบุอีเมล์ไห็ถูกต้อง เพราะระบบจะส่ง Username และ Password ให้กับท่านทางอีเมล์ที่ใช้สมัคร</div>
    <fieldset class="roundend">
      <h3 class="labela roundend">ข้อมูลการเข้าสู่ระบบ</h3>
      <p>
      	<label class="ccd">ชื่อเข้าใช้งาน (Username) :</label> 
      	<input type="text" name="username" maxlength="20"/>
        <span class="red">*</span>
        <small>ไม่ต่ำกว่า 6-20 ตัวอักษร</small>
      </p>
      <p>
      	<label class="ccd">รหัสผ่าน (Password) :</label> 
        <input type="password" name="password"/>
        <span class="red">*</span>
        <small>ไม่ต่ำกว่า 6-20 ตัวอักษร</small>
      </p>
      <p>
      	<label class="ccd">ยืนยันรหัสผ่าน :</label> 
        <input type="password" name="cpassword"/>
      </p>
    </fieldset>
    <fieldset class="roundend">
      <h3 class="labela roundend">ข้อมูลส่วนตัว</h3>
      <p>
        <label class="ccd">E-mail :</label>
        <input type="text" name="sm_email" id="sm_email" size="40">
        <span class="red">*</span>
      </p>
      <p>
        <label class="ccd">ชื่อ นามสกุล :</label>
        <input type="text" name="sm_anme" id="sm_anme" size="40">
        <span class="red">*</span>
      </p>
      <p>
        <label class="ccd">เพศ :</label>
        <input type="radio" value="ชาย" name="sm_sex" id="sm_sex" checked="checked">
        ชาย
        <input type="radio" value="หญิง" name="sm_sex" id="sm_sex">
        หญิง
      </p>
      <p>
        <label class="ccd">เลขที่บัตรประจำตัวประชาชน :</label>
        <input type="text" name="sm_pid" id="sm_pid" size="40">
        <span class="red">*</span>
      </p>
      <p>
        <label class="ccd">ที่อยู่บัจจุบัน :</label>
        <textarea name="sm_addr" id="sm_addr" rows="4" cols="37"></textarea>
      </p>
      <p>
        <label class="ccd">จังหวัด :</label>
        <select name="sm_district" id="sm_district">
          <? $sqeryd=mysql_query("select * from system_district");
                while(list($sdid,$sdname)=mysql_fetch_row($sqeryd)){
                ?>
          <option value="<?=$sdid;?>" <? if($sdid==$myself['sm_district']){?>selected<? }?>>
          <?=$sdname;?>
          </option>
          <? }?>
        </select>
      </p>
      <p>
        <label class="ccd">รหัสไปรษณีย์ :</label>
        <input type="text" name="sm_postcode" id="sm_postcode">
      </p>
      <p>
        <label class="ccd">หมายเลขโทรศัพท์มือถือ :</label>
        <input type="text" name="sm_mtel" id="sm_mtel">
        <span class="red">*</span></p>
      <p>
        <label class="ccd">หมายเลขโทรศัพท์บ้าน :</label>
        <input type="text" name="sm_htel" id="sm_htel">
      </p>
    </fieldset>
    
    <fieldset class="roundend">
      <h3 class="labela roundend">ข้อมูลบัญชีธนาคาร</h3>
      <p class="inpor">ข้อมูลบัญชีธนาคารมีความสำคัญมากเป็นช่องทางที่ท่านใชัรับรายได้จากทางเว็บไซด์ กรุณาตรวจสอบให้ถูกต้อง</p>
      <p>
        <label class="ccd">ธนาคาร :</label>
        <input type="text" name="sm_bank_name" id="sm_bank_name" size="40">
        <span class="red">*</span>
      </p>
      <p>
        <label class="ccd">สาขา :</label>
        <input type="text" name="sm_bank_area" id="sm_bank_area" size="40">
        <span class="red">*</span>
      </p>
      <p>
        <label class="ccd">ชื่อเจ้าของบัญชี :</label>
        <input type="text" name="sm_bank_acc" id="sm_bank_acc" size="40">
        <span class="red">*</span>
      </p>
      <p>
        <label class="ccd">เลขที่บัญชี :</label>
        <input type="text" name="sm_bank_id" id="sm_bank_id" size="40">
        <span class="red">*</span>
      </p>
      <p>
        <label class="ccd">ประเภทบัญชี :</label>
        <input type="text" name="sm_bank_type" id="sm_bank_type" size="40">
        <span class="red">*</span>
      </p>
    </fieldset>

    <fieldset class="roundend">
      <h3 class="labela roundend">ข้อมูลบัญชีธนาคาร</h3>
      <?php
        $result=mysql_fetch_assoc(mysql_query("SELECT sm_code, sm_name FROM system_member WHERE sm_id='$_GET[direct]'"));
      ?>
      <script type="text/javascript">
        function clearDirect() {
          $("#sm_direct_id").attr('placeholder', "");
          $("#sm_direct_name").attr('placeholder', "");
        }
        function setDirect() {
          if (($("#sm_direct_id").val()!="") || ($("#sm_direct_name").val()!="")){
            $("#sm_direct_id").attr('placeholder', "");
            $("#sm_direct_name").attr('placeholder', "");
            if ($("#sm_direct_id").val()!="") {
              $("#sm_direct_name").attr('disabled','disabled');
            } else if ($("#sm_direct_name").val()!="") {
              $("#sm_direct_id").attr('disabled','disabled');
            } else {
              $("#sm_direct_id").removeAttr('disabled');
              $("#sm_direct_name").removeAttr('disabled');
            }
          } else {
            $("#sm_direct_id").attr('placeholder', "<?=$result['sm_code']?>");
            $("#sm_direct_name").attr('placeholder', "<?=$result['sm_name']?>");
            $("#sm_direct_id").removeAttr('disabled');
            $("#sm_direct_name").removeAttr('disabled');
          }
        }
        function setTarget() {
          if ($("#sm_target_id").val()!="") {
            $("#sm_target_name").attr('disabled','disabled');
          } else if ($("#sm_target_name").val()!="") {
            $("#sm_target_id").attr('disabled','disabled');
          } else {
            $("#sm_target_id").removeAttr('disabled');
            $("#sm_target_name").removeAttr('disabled');
          }
        }
      </script>
      <p class="inpor" style="padding-left:170px;">* หากต้องการแก้ไขข้อมูลของผู้แนะนำ ให้กรอกรหัสหรือชื่อ อย่างใดอย่างหนึ่งเท่านั้น</p>
      <p>
        <label class="ccd">รหัสผู้แนะนำ :</label>
        <input type="text" name="sm_direct_id" id="sm_direct_id" size="40" placeholder="<?=$result['sm_code']?>" onKeyUp="setDirect();">
        <!-- <span class="red">* กรุณาตรวจสอบข้อมูลของผู้แนะนำให้ถูกต้อง ก่อนทำการสมัคร</span> -->
      </p>
      <p>
        <label class="ccd">ชื่อผู้แนะนำ :</label>
        <input type="text" name="sm_direct_name" id="sm_direct_name" size="40" placeholder="<?=$result['sm_name']?>" onKeyUp="setDirect();">
      </p>
      <p class="inpor" style="padding-left:170px;">* กรอกรหัสหรือชื่ออัพไลน์ อย่างใดอย่างหนึ่งเท่านั้น หากไม่ทราบ ให้เว้นว่างไว้</p>
      <p>
        <label class="ccd">รหัสอัพไลน์ :</label>
        <input type="text" name="sm_target_id" id="sm_target_id" size="40" onKeyUp="setTarget();">
        <!-- <span class="red">* ข้อมูลอัพไลน์ หากไม่ทราบ ให้เว้นว่างไว้</span> -->
      </p>
      <p>
        <label class="ccd">ชื่ออัพไลน์ :</label>
        <input type="text" name="sm_target_name" id="sm_target_name" size="40" onKeyUp="setTarget();">
      </p>
    </fieldset>

    <fieldset class="roundend">
      <div id="rulls">
        <div>
          <h2 style="color:rgb(26,26,26);font-family:Arial,Helvetica,sans-serif;background-color:rgb(255,255,255)">ข้อตกลงการให้บริการ</h2>
        </div>
        <div>
          <h2 style="color:rgb(26,26,26);font-family:Arial,Helvetica,sans-serif;background-color:rgb(255,255,255)"> </h2>
          <h2>
            <p style="clear:both;margin-right:0px;margin-bottom:0px;margin-left:0px;padding-top:0px;padding-right:0px;padding-bottom:0px;padding-left:0px;font-size:12px;font-weight:normal"> ยินดีต้อนรับทุกท่านเข้าสู่ ระบบ SPPINTER ที่ให้บริการขายสินค้าต่างๆ แก่สมาชิก เนื้อหาในข้อตกลงนี้ประกอบด้วย</p>
          </h2>
          <h4 style="font-size:12px">ข้อตกลงในการใช้บริการ SPPINTER</h4>
          <p style="clear:both;margin-right:0px;margin-bottom:0px;margin-left:0px;padding-top:0px;padding-right:0px;padding-bottom:0px;padding-left:0px;font-size:12px;font-weight:normal"> ข้อกำหนดและเงื่อนไขการให้บริการ SPPINTER<br>
            โดย ที่ SPPINTER (ทีจีร้อยแปดพันเก้า) ให้บริการขายสินค้า และผู้ใช้บริการประสงค์จะใช้บริการของเว็บไซด์โดยยินยอมผูกพันตามข้อกำหนดและเงื่อนไขในการให้บริการดังต่อไปนี้ทุกประการ&nbsp;<br>
            คำนิยาม บริการ SPPINTER คือ การให้บริการของเว็บไซด์ในการขายสินค้าในระบบ online ผ่านช่องทางที่เว็บไซด์กำหนด&nbsp;<br>
            “ผู้ใช้งาน” คือ สมาชิกที่สมัครเข้ามาใช้บริการ SPPINTER.NET<br>
            รหัสผู้ใช้งาน (Username) คือ รหัสที่ผู้ใช้บริการใช้ในการลงทะเบียนเพื่อขอใช้บริการ SPPINTER.NET&nbsp;<br>
            รหัสผ่าน (Password) คือ รหัสที่ผู้ใช้บริการกำหนดขึ้นเพื่อใช้ร่วมกับรหัสผู้ใช้งาน ในการใช้ บริการ SPPINTER.NET&nbsp;<br>
            ค่าสินค้าและ/หรือบริการ คือ ค่าสินค้าและ/หรือบริการคือราคา สินค้าและ/หรือบริการ นั้นๆ&nbsp;<br>
            “ขายสินค้า” คือ บริการที่เว็บไซด์นำสินค้าต่างๆมาขายตามราคาที่เว็บไซด์กำหนด</p>
          <h4 style="font-size:12px">สิทธิและหน้าที่ของผู้ใช้บริการ</h4>
          <ol style="font-size:12px;font-weight:normal">
            <li>ผู้ใช้บริการสามารถซื้อสินค้า ชำระค่าสินค้า และบริการต่างๆ ได้ โดยต้องอยู่ภายใต้ข้อกำหนดและเงื่อนไขที่เว็บไซด์กำหนดขึ้น</li>
            <li>การกระทำการใด ๆ โดยผ่านบริการไม่ว่ากรณีใดๆ ก็ตาม หากกระทำโดยใช้รหัสผู้ใช้บริการและรหัสผ่านของผู้ใช้บริการ และ/หรือ ตรงตามวิธีการหรือเงื่อนไขที่เว็บไซด์กำหนดไว้เกี่ยวกับการใช้บริการSPPINTER แล้ว ผู้ใช้บริการยอมให้ถือว่าการกระทำนั้นมีผลสมบูรณ์ โดยผู้ใช้บริการไม่ต้องลงลายมือชื่อเป็นหลักฐานในเอกสารใด ๆ อีก และยินยอมรับผิดชอบในการกระทำดังกล่าวเสมือนหนึ่งว่าผู้ใช้บริการเป็นผู้ กระทำด้วยตนเอง ทั้งนี้ไม่ว่าจะเกิดขึ้นด้วยความทุจริตของบุคคลภายนอกหรือไม่ก็ตาม ผู้ใช้บริการจะไม่เรียกร้องให้เว็บไซด์ต้องรับผิดชอบแต่อย่างใด</li>
            <li>ผู้ใช้บริการสามารถเปลี่ยนแปลงรหัสผ่าน (Password) ด้วยตนเองได้ตลอดระยะเวลาการใช้บริการ SPPINTER โดยไม่ต้องแจ้งให้เว็บไซด์ทราบ ทั้งนี้ ผู้ใช้บริการตกลงให้รหัสผ่าน (Password) ที่เปลี่ยนแปลงไป ในแต่ละขณะดังกล่าวเป็นรหัสผ่านการใช้บริการ SPPINTER ที่มีผลผูกพันผู้ใช้บริการตามข้อกำหนดและเงื่อนไขการใช้บริการนี้ทุกประการ</li>
            <li>รหัสผ่าน (Password) ถือเป็นความลับเฉพาะตัวของผู้ขอใช้บริการที่ต้องเก็บรักษาและปกปิดมิให้ผู้ อื่นล่วงรู้ ผู้ใช้บริการต้องเก็บรักษาไว้ด้วยตนเอง หากมีการใช้บริการรายการใดๆ โดยใช้รหัสผ่าน (Password) ของผู้ใช้บริการแล้ว ให้ถือว่าถูกต้องสมบูรณ์มีผลผูกพันผู้ใช้บริการเสมือนผู้ใช้บริการใช้บริการ ในครั้งนั้นๆ ด้วยตนเอง ทั้งนี้ เว็บไซด์ไม่สามารถล่วงรู้รหัสผ่าน (Password) ของผู้ใช้บริการได้ ดังนั้น เว็บไซด์จึงไม่ต้องรับผิดชอบในความเสียหายใดๆ ที่เกิดขึ้นในการใช้บริการ SPPINTER โดยรหัสผ่าน (Password) ของผู้ใช้บริการ</li>
            <li>ผู้ใช้บริการยอมรับว่าบันทึก หลักฐาน หรือเอกสารใดๆ ก็ตามที่เว็บไซด์ได้จัดทำขึ้นเนื่องจากการใช้บริการ SPPINTER ของผู้ใช้บริการนั้นมีความถูกต้องทุกประการ ไม่จำเป็นต้องให้ผู้ใช้บริการตรวจสอบหรือลงลายมือชื่อก่อนแต่อย่างใด สามารถใช้เป็นพยานหลักฐานยืนยันผู้ใช้บริการและบุคคลอื่นที่ใช้บริการร่วมกับ ผู้ใช้บริการในการพิสูจน์การชำระเงิน และ/หรือการใช้บริการใดๆ ได้โดยชอบ แม้ว่าข้อมูลนั้นจะเก็บรักษาและ/หรือรวบรวมไว้ในรูปของข้อมูลอิเล็กทรอนิกส์ หรือไม่ว่าในรูปแบบใดก็ตาม</li>
            <li>ในการใช้บริการ SPPINTER ผู้ใช้บริการจะต้องรับผิดชอบในการระบุข้อมูลเกี่ยวกับผู้รับสินค้าและหรือ บริการ จำนวนเงิน และรายละเอียดอื่นๆ เพื่อการใช้บริการ SPPINTER ด้วยตนเอง หากเกิดข้อผิดพลาดใดๆ ผู้ใช้บริการจะไม่เรียกร้องให้เว็บไซด์ต้องรับผิดชอบในความเสียหายใดๆ ทั้งสิ้น</li>
            อนึ่ง การทำรายการของผู้ใช้บริการตามวรรคแรกที่เสร็จสิ้นสมบูรณ์แล้ว ผู้ใช้บริการจะไม่สามารถทำรายการยกเลิกหรือแก้ไขรายการได้ แต่ทั้งนี้ หากกรณีมีข้อผิดพลาดหรือข้อสงสัยใด ๆ ให้ผู้ใช้บริการแจ้งให้เว็บไซด์ทราบผ่านช่องทางที่เว็บไซด์กำหนดไว้ ภายใต้เงื่อนไขในข้อ 6 ของข้อกำหนดและเงื่อนไขการให้บริการนี้
            <li> ในกรณีพบข้อผิดพลาดหรือข้อสงสัยใด ๆ ในการใช้บริการ ผู้ใช้บริการต้องรีบแจ้งให้เว็บไซด์ทราบผ่านทางช่องทางที่เว็บไซด์กำหนด พร้อมด้วยข้อมูล ดังต่อไปนี้
              <ol>
                <li>วันและเวลาที่ทำรายการ</li>
                <li>ประเภทของบริการ</li>
                <li>ชื่อ สถานที่ติดต่อของผู้ใช้บริการและผู้แจ้ง</li>
                <li>รายละเอียดความผิดพลาดที่เกิดขึ้น</li>
                <li>หมายเลขอ้างอิง (ถ้ามี) และ/หรือข้อมูลอื่นใดที่เกี่ยวข้องตามที่เห็นสมควร</li>
              </ol>
            </li>
            <li>ผู้ใช้บริการขอรับรองว่าผู้ใช้บริการมีชื่อเป็นผู้จดทะเบียนเลขหมาย โทรศัพท์เคลื่อนที่และ/หรือเป็นผู้ครอบครองและ/หรือมีสิทธิใช้บริการ โทรศัพท์เคลื่อนที่เลขหมายที่ได้ลงทะเบียนใช้บริการ SPPINTER&nbsp;</li>
            <li>ผู้ใช้บริการรับทราบว่า การใช้บริการใดๆ ต้องให้ระยะเวลาอันสมควรแก่บริษัทในการดำเนินการตามขั้นตอนที่จำเป็นเพื่อ ให้บริการ โดยผู้ใช้บริการจะไม่เรียกร้องให้บริษัทต้องรับผิดชอบต่อความเสียหายใดๆ ที่เกิดจากความล่าช้าในขั้นตอนของการดำเนินการ</li>
            <li>ผู้ใช้บริการยินยอมให้เว็บไซด์ติดต่อสอบถามหรือเปิดเผยราย ละเอียดหรือข้อมูลบางประการหรือทั้งหมด เกี่ยวกับผู้ใช้บริการที่เว็บไซด์รับทราบมาเนื่องจากการใช้บริการใดๆ ของผู้ใช้บริการกับเว็บไซด์ กับบุคคล และ/หรือนิติบุคคลใดๆ ได้ตามความจำเป็นและเหมาะสม โดยเว็บไซด์ไม่ต้องขออนุญาตหรือได้รับความยินยอมจากผู้ใช้บริการแต่อย่างใด ทั้งนี้ให้ถือว่าความยินยอมนี้มีผลใช้บังคับตลอดไป แม้ว่าผู้ใช้บริการจะมิได้ใช้บริการตามคำขอใช้บริการนี้ หรือมิได้ใช้บริการใดๆกับเว็บไซด์แล้วก็ตาม</li>
            <li>กรณี ที่เว็บไซด์ไม่สามารถให้บริการ &nbsp;แก่ผู้ใช้บริการได้ อันเนื่องมาจากกรณีที่ระบบคอมพิวเตอร์ หรือระบบการติดต่อสื่อสาร ของบริษัท ของผู้ใช้บริการ หรือของผู้ให้บริการระบบอินเทอร์เน็ต (Internet Service Provider) หรือของผู้ให้บริการเครือข่ายโทรศัพท์เคลื่อนที่ (Mobile Operator) หรือ ระบบไฟฟ้า ระบบการติดต่อสื่อสาร หรือระบบอื่นใดที่เกี่ยวข้องกับการให้บริการขัดข้อง หรือปิดระบบชั่วคราวเพื่อปรับปรุง หรือบำรุงรักษา เป็นเหตุให้ผู้ใช้บริการไม่สามารถใช้บริการได้ ผู้ใช้บริการตกลงจะไม่ยกเอาเหตุขัดข้องดังกล่าว มาเป็นข้อเรียกร้องให้บริษัทต้องรับผิดชอบแต่อย่างใด</li>
            <li>บริษัทจะดำเนินการตามขั้นตอนอันสมควรสำหรับการให้ความปลอดภัย ในการส่งผ่านข้อมูลและ/หรือติดต่อสื่อสารระหว่างผู้ใช้บริการกับบริษัทโดย ผ่านทางระบบอินเทอร์เน็ต (Internet) แต่อย่างไรก็ตาม ผู้ใช้บริการรับทราบว่าบริษัทไม่สามารถรับประกันความปลอดภัยได้อย่างสมบูรณ์ เนื่องจากการใช้งานอย่างเปิดกว้างของระบบอินเทอร์เน็ต (Internet) โดยผู้ใช้บริการตกลงยินยอมรับความเสี่ยงของระบบดังกล่าว</li>
            <li>ผู้ใช้บริการตกลงยินยอมให้เว็บไซด์มีสิทธิเพิ่มเติม เปลี่ยนแปลง หรือยกเลิกเงื่อนไขข้อกำหนดและวิธีปฏิบัติเกี่ยวกับการใช้บริการ SPPINTER เมื่อใดก็ได้โดยไม่ต้องได้รับความเห็นชอบจากผู้ใช้บริการก่อน สิทธิและหน้าที่ของเว็บไซด์</li>
            <li>เว็บไซด์มีสิทธิที่จะเปลี่ยนแปลงอัตราและ/หรือวิธีการเรียกเก็บค่า ธรรมเนียมและ/หรือค่าใช้บริการ และ/หรือค่าใช้จ่ายใดๆ อันเกี่ยวเนื่องกับการใช้บริการ SPPINTER เมื่อใดก็ได้ตามที่เว็บไซด์เห็นสมควร ทั้งนี้หากผู้ใช้บริการใช้บริการภายหลังจากวันที่การเปลี่ยนแปลงดังกล่าวมี ผลบังคับใช้ ให้ถือว่าผู้ใช้บริการตกลงยอมรับอัตราค่าธรรมเนียมที่มีการเปลี่ยนแปลงนั้น แล้ว</li>
            <li>เนื่องจากผู้ใช้บริการเป็นผู้ทำรายการในการใช้บริการ SPPINTER ด้วยตนเอง ดังนั้น เว็บไซด์ไม่ต้องรับผิดชอบในข้อผิดพลาดหรือบกพร่อง หรือความเสียหายใด ๆ อันอาจเกิดขึ้นทั้งสิ้น และผู้ใช้บริการจะไม่นำไปเป็นข้ออ้างยืนยัน และ/หรือใช้เป็นหลักฐานโต้แย้งหรือฟ้องร้องต่อเว็บไซด์ เว้นแต่จะเกิดจากการกระทำโดยจงใจหรือประมาทเลินเล่ออย่างร้ายแรงของเว็บไซด์ เท่านั้น</li>
            <li>ภายหลังจากที่เว็บไซด์ได้รับแจ้งจากผู้ใช้บริการกรณีพบข้อผิดพลาดหรือข้อสงสัยตามวิธีการที่เว็บไซด์กำหนดแล้ว เว็บไซด์จะทำการตรวจสอบข้อผิดพลาดโดยพิจารณาจากข้อมูลในรายงาน ซึ่งถือเป็นหลักฐานของเว็บไซด์ โดยเมื่อตรวจสอบแล้วเว็บไซด์จะแจ้งผลการตรวจสอบและ/หรือการแก้ไขให้ผู้ใช้ บริการทราบโดยเร็ว โดยใช้หลักเกณฑ์ และขั้นตอนการปฏิบัติของเว็บไซด์</li>
            <li>หากเว็บไซด์ได้รับแจ้งเป็นหนังสือจากบริษัทผู้ให้บริการเครือ ข่ายโทรศัพท์เคลื่อนที่ว่าได้มีการเปลี่ยนแปลงหรือยกเลิกกรรมสิทธิ์ในหมายเลขโทรศัพท์เคลื่อนที่สำหรับการใช้บริการ (ถ้ามี) ผู้ใช้บริการตกลงให้ถือว่าผู้ใช้บริการยินยอมให้เว็บไซด์ยกเลิกการใช้บริการ ประเภทที่กำหนดให้มีหมายเลขโทรศัพท์เคลื่อนที่ของผู้ใช้บริการทันที โดยมิต้องแจ้งให้ผู้ใช้บริการทราบแต่อย่างใด</li>
            <li>เว็บไซด์มีสิทธิในการเปลี่ยนแปลงเพิ่มหรือลดการให้บริการเฉพาะ บริการใดบริการหนึ่ง หรือยกเลิกการให้บริการทั้งหมดได้ หรือเฉพาะแต่ผู้ใช้บริการรายใดรายหนึ่งเมื่อใดก็ได้ โดยจะแจ้งให้ผู้ใช้บริการทราบผ่านเว็บไซต์ หรือช่องทางอื่นที่เว็บไซด์กำหนดขึ้นเพิ่มเติม ทั้งนี้ในกรณีที่ผู้ใช้บริการได้ใช้บริการที่เว็บไซด์จัดให้ใหม่ หรือเพิ่มเติมเปลี่ยนแปลงแล้ว ถือว่าผู้ใช้บริการได้ตกลงยอมรับเงื่อนไขและ ข้อตกลงที่มีผลใช้บังคับแก่บริการที่เว็บไซด์ได้จัดให้ใหม่หรือเพิ่มเติม เปลี่ยนแปลงนั้นแล้ว</li>
            <li>เว็บไซด์ขอสงวนสิทธิ์ที่จะโอนสิทธิ หน้าที่ของการให้บริการ SPPINTER นี้แก่บุคคลอื่นใดได้ โดยไม่จำต้องได้รับความยินยอมจากผู้ใช้บริการ ทั้งนี้ การโอนสิทธิ หน้าที่ดังกล่าวจะไม่กระทบต่อสิทธิและหน้าที่ของผู้ใช้บริการที่มีอยู่ ณ วันโอน</li>
            <li>เว็บไซด์อาจยกเว้นหรือเรียกเก็บค่าธรรมเนียม และ/หรือค่าใช้บริการ และ/หรือค่าใช้จ่ายใดๆ ที่เกี่ยวเนื่องกับการใช้บริการ SPPINTER ในอัตราที่ต่ำกว่าที่กำหนดไว้ได้ตามรายการส่งเสริมการขายและการให้บริการ ที่กำหนดขึ้นเป็นคราวๆ ไป</li>
            <li>เว็บไซด์มีสิทธิที่จะปฏิเสธไม่รับลงทะเบียนขอใช้บริการจากบุคคลใดๆ หรือจากผู้ใช้บริการ หรือไม่เปิดให้ใช้บริการต่างๆ ตามที่ผู้ให้บริการเห็นสมควร โดยไม่จำเป็นต้องแจ้งเหตุผลให้ทราบ</li>
            <li>เว็บไซด์มีหน้าที่เพียงขายสินค้าและ/หรือค่าบริการ โดยไม่มีส่วนรู้เห็นในสัญญาที่ผู้ใช้บริการได้ทำไว้กับเจ้าของสินค้าและ /หรือบริการ หรือสิทธิและหน้าที่ต่างๆที่ผู้ใช้บริการและเจ้าของสินค้าและ/หรือบริการมี ต่อกัน หากเกิดข้อพิพาทใดๆ ขึ้นระหว่างเจ้าของสินค้าและ/หรือบริการกับผู้ใช้บริการ เว็บไซด์ไม่ต้องร่วมรับผิดใดๆ ทั้งสิ้น&nbsp;</li>
            <li>เอกสารหรือหนังสือใดๆ ที่เว็บไซด์ส่งไปยังผู้ใช้บริการตามที่อยู่หรือสถานที่อื่น หรือไปรษณีย์อิเล็กทรอนิกส์ (E-MAIL) ที่ผู้ใช้บริการได้แจ้งไว้ในการลงทะเบียนใช้บริการนี้ หรือที่ผู้ใช้บริการได้แจ้งเปลี่ยนในภายหลัง ให้ถือว่าผู้ใช้บริการได้ทราบข้อความในเอกสารหรือหนังสือนั้นๆ แล้ว</li>
            <li>กรณีข้อกำหนดและเงื่อนไขการใช้บริการที่กำหนดขึ้นนี้ หรือที่จะมีเพิ่มเติมในภายหน้าบางส่วนตกเป็นโมฆะ และหรือไม่สามารถบังคับได้ตามกฎหมาย มิให้ถือว่าส่วนอื่นเป็นโมฆะ และหรือเสียไปทั้งหมด โดยให้ข้อกำหนดและเงื่อนไขอื่นๆ ยังคงมีผลบังคับใช้ต่อไป.</li>
          </ol>
        </div>
      </div>
      <p align="center">
        <input type="checkbox" name="btncheck" id="btncheck" value="1">
        ยอมรับเงือนไขและข้อตกลง</p>
      <br>
      <p align="center">
        <input type="submit" name="btmsubmit" value="สมัครสมาชิก">
      </p>
      <div class="regist-error" style="padding-top:20px;"></div>
    </fieldset>
  </form>
  <? if($jn==0){?>
  <div id="lightbox-panel" class="roundend">
    <h2 align="center">ขออภัย ลิ้งผู้แนะนำของคุณไม่ถูกต้อง</h2>
    <p align="center">ขออภัยค่ะ ลิ้งค์ผู้แนะนำของคุณไม่ถูกต้องหรือไม่มีอยู่จริง หากคุณต้องการ<br>
      สมัครสมาชิกโปรดสมัครสมาชิกจากลิ้งค์ของผู้แนะนำเท่านั้นค่ะ ขอบคุณค่ะ</p>
    <p align="center"><img src="../images/logo.png"></p>
  </div>
  <!-- /lightbox-panel -->
  
  <div id="lightbox"></div>
  <!-- /lightbox -->
  </p>
  <? } ?>
</div>
